/*=====================================================================
//	工程名称:	  iRobot
//	功能描述:  管道机器人控制		
//  IDE 环境:  Keil uVision5.1
//  组成文件:	  sys.h, delay.c
//  硬    件:   STM32F103ZET6-LQFP144 晶振频率:72MHZ
//  硬件资源: 
//  维护记录:	  2015-09-28	v1.0
======================================================================*/
#ifndef __DELAY_H
#define __DELAY_H 			   
#include "sys.h"

void Delay_init(void);
void Delay_ms(u16 nms);
void Delay_us(u32 nus);

#endif
/*:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
End:-D:-D:-D:-D:-D:-D:-D:-D:-D:-D:-D:-D:-D:-D:-D:-D:-D:-D:-D:-D
:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::*/































